In [1]:
import pandas as pd
import numpy as np

## Creating the dataframe

In [2]:
df = pd.DataFrame(np.arange(9).reshape(3,3), columns=["a", "b", "c"])

In [3]:
display(df)

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [9]:
len(df) # Number of rows in dataframe

3

In [10]:
df.shape # 3 rows and 3 columns

(3, 3)

In [11]:
df.index.size # Number of rows based on index

3

In [12]:
df.index #Size property above provided the length

RangeIndex(start=0, stop=3, step=1)

In [13]:
number_of_rows = len(df.index)

In [14]:
number_of_rows

3

## axes property

In [16]:
number_of_rows = df.axes[0].size

In [18]:
number_of_rows

3

In [19]:
number_of_columns = df.axes[1].size

In [20]:
number_of_columns

3

In [21]:
len(df.columns) # Number of columns in the dataframe

3

## Dropping rows and columns
Normall return new objects, original dataframe unchanged

In [22]:
# Dropping first row

df.drop(0, axis=0)

   a  b  c
1  3  4  5
2  6  7  8

In [23]:
df # Original dataframe unchanged

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [24]:
# dropping first and third row

df.drop([0,2], axis=0)

   a  b  c
1  3  4  5

In [27]:
# to drop column, refer to label to tell penda to drop

df.drop(["b", "c"], axis=1)

   a
0  0
1  3
2  6

In [28]:
df # Original dataframe does not change

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

## Arithmetic operation
add(), sub(), div(), mul()

In [29]:
df["a"] + df["b"]

0     1
1     7
2    13
dtype: int64

In [30]:
df["a"].add(df["b"])

0     1
1     7
2    13
dtype: int64

## Adding a row

In [31]:
df

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [33]:
df # 3 rows

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [34]:
df.loc[0:1, :] #2 rows

   a  b  c
0  0  1  2
1  3  4  5

In [35]:
df.add(df.loc[0:1, :]) #Adding two dataframes of diffeent size

     a    b     c
0  0.0  2.0   4.0
1  6.0  8.0  10.0
2  NaN  NaN   NaN

In [36]:
# Fill 0

df.add(df.loc[0:1, :], fill_value=0) # Without resulting NaN

     a    b     c
0  0.0  2.0   4.0
1  6.0  8.0  10.0
2  6.0  7.0   8.0

## Concatenating Dataframes

Same columns - stack them one on top of other

In [37]:
df1 = pd.DataFrame([["Mark", 50], ["Kate", 45]], columns=["name", "age"])

In [38]:
df1

   name  age
0  Mark   50
1  Kate   45

In [42]:
df2 = pd.DataFrame([["Jon", 3], ["David", 4]], columns=["name", "age"])

In [43]:
df2

    name  age
0    Jon    3
1  David    4

In [44]:
# Concantenate top of another

pd.concat([df1, df2])  #Index will be necessary to reset

    name  age
0   Mark   50
1   Kate   45
0    Jon    3
1  David    4

In [45]:
# Gluing columns of two dataframe

df3 = pd.DataFrame(["Writer", "Journalist"], columns=["occupation"])

In [46]:
df3

   occupation
0      Writer
1  Journalist

In [47]:
# Now Join the df3 to df1 to add additional column

pd.concat([df1, df3], axis=1)

   name  age  occupation
0  Mark   50      Writer
1  Kate   45  Journalist

In [48]:
df1

   name  age
0  Mark   50
1  Kate   45

In [49]:
df2

    name  age
0    Jon    3
1  David    4

In [50]:
df3

   occupation
0      Writer
1  Journalist